app/controllers/api/orders_controller.rb

INSERT INTO "orders" ("first_name", "last_name", "phone_number", "address", "total_price", "card_number", "expiry", "csv", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
        @order = Order.create(order_params)