app/controllers/api/products_controller.rb

SELECT "products".* FROM "products"
---
    def featured
        @products = Product.all