app/controllers/api/products_controller.rb

SELECT "products".* FROM "products" WHERE (featured_products = 'f' OR featured_products IS NULL)
---
    def featured
        @products = Product.where("featured_product = 't'").limit(6)

INSERT INTO "products" ("title", "descripiton", "price", "quantity", "image_url", "created_at", "updated_at", "featured_products") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @product = Product.create(product_params)