app/views/api/orders/index.json.jbuilder

SELECT "orders".* FROM "orders"
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = $1  [["order_id", 1]]
---
    json.total_price order.total_price
    json.order_details order.order_details