app/controllers/orders_controller.rb

    def create
        @order = Order.create(order_params)
---
INSERT INTO "orders" ("address", "quantity", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "Lahore"], ["quantity", 3], ["price", 300], ["created_at", "2022-11-14 07:42:04.229827"], ["updated_at", "2022-11-14 07:42:04.229827"]]